app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Seth"], ["updated_at", "2020-02-25 23:52:33.127533"], ["id", 2]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)